{
  "backend/main.mo": "Motoko canister managing user profiles and game stats with access‑controlled queries and updates for users and admins.",
  "feature_evidence.json": "Feature evidence report mapping gameplay VFX and rendering features to the frontend files and components they modify.",
  "frontend-file-summaries.txt": "Prewritten summaries listing the purpose of each frontend file across UI, rendering, controls, and persistence.",
  "frontend/docs/IMPLEMENTATION_GUIDE.md": "High‑level guide describing project structure and implementation approach for the space shooter game.",
  "frontend/index.css": "Global Tailwind/CSS variables defining OKLCH color themes, dark mode tokens, and base styling rules.",
  "frontend/index.html": "Base HTML entrypoint loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component controlling menu/game state and syncing high scores via backend stats API.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button with state handling and React Query cache clearing.",
  "frontend/src/game/controls/Joystick.tsx": "Touch joystick component calculating dynamic movement vectors with drag and orientation‑safe handling.",
  "frontend/src/game/controls/ShootButton.tsx": "Touch and mouse reactive shoot button that triggers start/stop shooting events and handles visibility/orientation resets.",
  "frontend/src/game/controls/useCombinedControls.ts": "Merges keyboard, joystick, and touch shoot inputs into a single control state with deadzone and magnitude comparison.",
  "frontend/src/game/controls/useKeyboardControls.ts": "Tracks WASD/arrow keys and spacebar to produce movement and shooting control values.",
  "frontend/src/game/persistence/useSavedStats.ts": "Loads and saves persistent game stats via an actor with React Query caching and invalidation.",
  "frontend/src/game/render/GameCanvas.tsx": "Canvas renderer that draws the player, bullets, and other game elements with responsive resizing and neon-styled graphics.",
  "frontend/src/game/types.ts": "Defines TypeScript types for all game entities, bullets, enemies, effects, controls, and overall game state.",
  "frontend/src/game/ui/Hud.tsx": "HUD displaying score, level, pause button, progress bar, and optional level completion message.",
  "frontend/src/game/ui/TouchControlsDebugOverlay.tsx": "Debug overlay showing touch detection, forced control state, and pause status.",
  "frontend/src/game/useGameEngine.ts": "Main game engine hook managing state, movement, shooting, spawning, scoring, levels, and the game loop.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useDynamicViewport.ts": "Updates a CSS variable for dynamic viewport height using visualViewport events.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout, and identity loading via a React context.",
  "frontend/src/hooks/useQueries.ts": "Minimal placeholder file exporting nothing.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for theming and responsive sizing.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/screens/GameScreen.tsx": "Renders the gameplay view with canvas, HUD, controls, and manages game state events.",
  "frontend/src/screens/MenuScreen.tsx": "Displays the main menu with logo, high score, start button, and control instructions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH-based color palette, neon colors, container settings, and custom animations with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks overall project state, requirements, architecture notes, known issues, and implemented features for a ReactJS neon-style space shooter game."
}