{
  "backend/main.mo": "Motoko canister handling user profiles, game stats, and in-progress runs with strict access control checks for users and admins.",
  "feature_evidence.json": "Feature evidence report mapping gameplay requirements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of all major frontend files including game engine, UI, controls, and styles.",
  "frontend/docs/IMPLEMENTATION_GUIDE.md": "High‑level documentation outlining the project structure and implementation approach for the Space Shooter game.",
  "frontend/index.css": "Global Tailwind‑based CSS defining theme variables, dark mode tokens, and base styling utilities.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Top‑level app managing menu/play modes, high score handling, saved run resume, and theme configuration.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button with loading state, error recovery, and query cache clearing.",
  "frontend/src/components/RotateDeviceOverlay.tsx": "Overlay prompting users to rotate their device to landscape mode for gameplay.",
  "frontend/src/game/controls/Joystick.tsx": "Implements a touch and mouse-driven joystick that reports normalized movement based on drag distance and handles resets on visibility or orientation changes.",
  "frontend/src/game/controls/ShootButton.tsx": "Defines a touch and mouse-activated shoot button that triggers shooting state changes and resets on visibility or orientation changes.",
  "frontend/src/game/controls/useCombinedControls.ts": "Merges keyboard, joystick, and touch shooting inputs into a single control state, choosing the strongest movement source and OR-ing shooting.",
  "frontend/src/game/controls/useKeyboardControls.ts": "Tracks WASD/arrow and spacebar keys to produce directional movement and shooting state.",
  "frontend/src/game/persistence/inProgressRunStorage.ts": "Saves, loads, and clears in-progress run data in localStorage with version validation.",
  "frontend/src/game/persistence/useInProgressRun.ts": "Provides React Query hooks to check, load, save, and clear in-progress runs using local storage and an optional backend actor.",
  "frontend/src/game/persistence/useSavedStats.ts": "Loads and saves persistent game stats through a backend actor using React Query.",
  "frontend/src/game/render/GameCanvas.tsx": "Renders the game state onto a fullscreen canvas, drawing the player, bullets, enemies, and effects with vector graphics and glow effects.",
  "frontend/src/game/types.ts": "Defines TypeScript types for all game entities, game state, phases, and controls.",
  "frontend/src/game/ui/Hud.tsx": "Renders the game's HUD including score, timer, level, boss progress, and a pause button with responsive UI styling.",
  "frontend/src/game/ui/TouchControlsDebugOverlay.tsx": "Displays a small debug overlay showing touch detection, forced controls status, and pause state.",
  "frontend/src/game/useGameEngine.ts": "Implements the core game loop and state management including levels, enemies, bullets, timing, and pause/resume handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useDynamicViewport.ts": "Tracks visual viewport changes and updates a CSS variable for stable mobile layout sizing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context and hooks for Internet Identity authentication, loading, login, clearing, and tracking login state.",
  "frontend/src/hooks/useLandscapeOrientation.ts": "Detects device orientation, exposes portrait/landscape state, and provides optional orientation lock helpers.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing for game-specific query separation.",
  "frontend/src/index.css": "Defines Tailwind layers and a large set of CSS variables for theme and responsive UI sizing across devices.",
  "frontend/src/main.tsx": "Initializes React, wraps the app with query and identity providers, and loads global styles.",
  "frontend/src/screens/GameScreen.tsx": "Main gameplay screen that wires controls, game engine state, orientation lock, autosaving, and triggers game over callbacks while rendering canvas, HUD, and mobile controls.",
  "frontend/src/screens/MenuScreen.tsx": "Renders the main menu with background, logo, high score display, and buttons to start or continue a saved run.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, animations, and themes with neon palette and utility plugins.",
  "project_state.json": "Project metadata describing the game’s level progression, boss mechanics, HUD behavior, and countdown timer requirements."
}