{
  "backend/main.mo": "Motoko canister implementing access‑controlled user profiles, game stats, and in‑progress run storage with admin and per‑user permissions.",
  "feature_evidence.json": "Feature evidence report listing touch‑controls related tasks, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing purpose and behavior of major frontend files.",
  "frontend/docs/IMPLEMENTATION_GUIDE.md": "High‑level implementation guide outlining project structure and tech overview for the Space Shooter game.",
  "frontend/index.css": "Tailwind base config and OKLCH variable definitions for theming, including dark mode values and global styling.",
  "frontend/index.html": "Bare HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root app component handling game state transitions, stats loading/saving, in‑progress run restoration, and theme setup.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that logs errors and shows a recovery UI with reload option.",
  "frontend/src/components/LoginButton.tsx": "Authentication button managing Internet Identity login/logout with visual states and query cache clearing.",
  "frontend/src/components/RotateDeviceOverlay.tsx": "Full‑screen overlay prompting users to rotate to landscape mode when required.",
  "frontend/src/game/controls/Joystick.tsx": "Implements a touch joystick that tracks pointer movement, normalizes output, and resets on lifecycle events.",
  "frontend/src/game/controls/ShootButton.tsx": "Provides a touch-based shoot button using pointer events and lifecycle resets to signal shooting state.",
  "frontend/src/game/controls/useCombinedControls.ts": "Merges keyboard, joystick, and touch shooting into a single control state using magnitude comparison and deadzone logic.",
  "frontend/src/game/controls/useKeyboardControls.ts": "Tracks WASD/arrow/space key states and outputs movement and shooting values.",
  "frontend/src/game/persistence/inProgressRunStorage.ts": "Saves, loads, validates, and clears in-progress run data in localStorage with versioning.",
  "frontend/src/game/persistence/useInProgressRun.ts": "Syncs in-progress run data between localStorage and backend via React Query with save/load helpers.",
  "frontend/src/game/persistence/useSavedStats.ts": "Loads and saves persistent player stats through the backend using React Query.",
  "frontend/src/game/render/drawPlayerShip.ts": "Renders a vector-based player ship with gradients, glow effects, and engine light on a canvas.",
  "frontend/src/game/render/GameCanvas.tsx": "Renders the game state to a canvas, handling resizing and drawing borders, player, bullets, and enemies.",
  "frontend/src/game/types.ts": "Defines core game types for players, bullets, enemies, effects, controls, and game state.",
  "frontend/src/game/ui/Hud.tsx": "Implements the main HUD, showing score, timer, phase, level, and a pause dialog.",
  "frontend/src/game/ui/TouchControlsDebugOverlay.tsx": "Displays a diagnostic overlay showing touch capability, state flags, and visibility metrics for touch controls.",
  "frontend/src/game/ui/TouchControlsHints.tsx": "Shows temporary hints for using touch controls, auto-hiding after a few seconds.",
  "frontend/src/game/ui/useTouchControlsDomSanityCheck.ts": "Hook measuring joystick and shoot button DOM elements and logging visibility or sizing issues.",
  "frontend/src/game/useGameEngine.ts": "Main game engine hook handling state, level logic, timing, spawning, collisions, and effects.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refetching dependent queries on change.",
  "frontend/src/hooks/useDynamicViewport.ts": "Tracks visualViewport changes and updates a CSS variable for dynamic viewport height on mobile devices.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useIsTouchCapable.ts": "Determines whether the device supports touch input using multiple capability signals and event listeners.",
  "frontend/src/hooks/useLandscapeOrientation.ts": "Tracks mobile orientation state and exposes helpers to lock or unlock screen orientation to landscape.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing for future query hooks.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for a neon theme, including colors and touch control sizes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/screens/GameScreen.tsx": "Implements the main game screen, wiring controls, orientation handling, game engine state, and touch UI elements.",
  "frontend/src/screens/MenuScreen.tsx": "Renders the game's main menu with branding, high score display, and options to start or continue a game.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), handle boolean params, and persist or clear values via sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with extended colors, shadows, animations, and plugins for typography and animations.",
  "project_state.json": "Defines project metadata and known issues, including tasks related to fixing invisible touch controls in production."
}