{
  "backend/main.mo": "Motoko canister handling user profiles and game stats with access control for users and admins.",
  "feature_evidence.json": "Feature evidence report mapping UI replacement tasks to involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference list summarizing major frontend files, their responsibilities, and gameplay/UI roles.",
  "frontend/docs/IMPLEMENTATION_GUIDE.md": "High-level implementation guide describing project structure and overall IC-powered game architecture.",
  "frontend/index.css": "Tailwind base styles and OKLCH variable definitions for themes, neon colors, and global UI tokens.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React component managing menu/playing states, high score loading/saving, and theme setup.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button managing authentication state and clearing React Query cache.",
  "frontend/src/game/controls/Joystick.tsx": "Touch joystick with drag handling, movement normalization, and full lifecycle/reset event listeners.",
  "frontend/src/game/controls/ShootButton.tsx": "A touch and mouse-enabled shoot button that triggers start and end shooting events with visual neon styling.",
  "frontend/src/game/controls/useCombinedControls.ts": "Merges keyboard, joystick, and touch shooting into one control state, preferring the stronger movement input.",
  "frontend/src/game/controls/useKeyboardControls.ts": "Tracks WASD, arrow keys, and spacebar to produce movement and shooting control values.",
  "frontend/src/game/persistence/useSavedStats.ts": "Loads and saves player game stats through an actor, using React Query for caching and mutations.",
  "frontend/src/game/render/GameCanvas.tsx": "Renders the game state to a full-screen canvas, including the player ship, bullets, and effects with neon visuals.",
  "frontend/src/game/types.ts": "Defines TypeScript types for all game entities and the overall game state.",
  "frontend/src/game/ui/Hud.tsx": "Displays score, level, progress bar, pause controls, and level-complete overlays.",
  "frontend/src/game/ui/TouchControlsDebugOverlay.tsx": "Shows debug info for touch detection, forced controls, and pause state.",
  "frontend/src/game/useGameEngine.ts": "Runs the main game loop, updating player movement, shooting, enemies, levels, and game state progression.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useDynamicViewport.ts": "Tracks visualViewport changes and updates a CSS variable for consistent dynamic viewport height on mobile.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing; game-specific queries are defined elsewhere.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, dynamic viewport utilities, and UI effect classes for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/screens/GameScreen.tsx": "Implements the gameplay UI including canvas, HUD, controls, dialogs, and integrates dynamic viewport handling.",
  "frontend/src/screens/MenuScreen.tsx": "Renders the main menu with background, high score display, control instructions, start button, and login option.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom neon color palette, container settings, and custom animations/plugins for the frontend.",
  "project_state.json": "Project state metadata describing game goals, architecture notes, known UI issues, and existing implemented features for a neon-styled React space shooter."
}