{
  "backend/main.mo": "Motoko canister managing user profiles, game stats, and in‑progress runs with permission-checked queries and updates using AccessControl.",
  "feature_evidence.json": "Feature evidence report mapping UI/control updates to affected files, components, and test IDs with high confidence flags.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of all frontend files, including game screens, controls, hooks, and styles.",
  "frontend/docs/IMPLEMENTATION_GUIDE.md": "High-level implementation guide outlining the structure and technology stack of the Space Shooter game.",
  "frontend/index.css": "Base Tailwind layer defining root color tokens, dark mode overrides, and global background/foreground styling.",
  "frontend/index.html": "Root HTML file mounting the React app and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Top-level React component controlling menu/game state transitions, high score syncing, and resume-data handling.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button with status handling, error recovery, and neon-themed styling.",
  "frontend/src/components/RotateDeviceOverlay.tsx": "Overlay prompting users to rotate to landscape mode, with safe-area padding and neon visuals.",
  "frontend/src/game/controls/Joystick.tsx": "Touch/mouse joystick control implementing drag-based movement, clamped radius logic, and full event cleanup on orientation and visibility changes.",
  "frontend/src/game/controls/ShootButton.tsx": "Touch and mouse event-driven shoot button that triggers start and stop shooting states.",
  "frontend/src/game/controls/useCombinedControls.ts": "Merges keyboard, joystick, and touch shooting inputs into a single movement and shooting control state.",
  "frontend/src/game/controls/useKeyboardControls.ts": "Tracks WASD/arrow keys and spacebar to produce movement and shooting control values.",
  "frontend/src/game/persistence/inProgressRunStorage.ts": "Handles saving, loading, version-checking, and clearing in-progress run data from localStorage.",
  "frontend/src/game/persistence/useInProgressRun.ts": "Manages loading, saving, and clearing in-progress runs using localStorage and backend sync via React Query.",
  "frontend/src/game/persistence/useSavedStats.ts": "Loads and saves persistent player stats through the backend using React Query mutations.",
  "frontend/src/game/render/drawPlayerShip.ts": "Draws a detailed vector-based player ship with gradients, glow effects, and highlights.",
  "frontend/src/game/render/GameCanvas.tsx": "Canvas renderer that sizes the canvas and draws the playfield, player, bullets, and other game elements.",
  "frontend/src/game/types.ts": "Defines shared game types including player, bullets, enemies, explosions, sparks, and overall game state.",
  "frontend/src/game/ui/Hud.tsx": "UI component rendering game HUD elements like score, timer, level, pause, and boss progress with dynamic styling and formatting.",
  "frontend/src/game/ui/TouchControlsDebugOverlay.tsx": "Displays debug information for touch-control detection, visibility logic, and input state.",
  "frontend/src/game/useGameEngine.ts": "Custom hook implementing the core game loop, state management, entity updates, timers, and resume logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useDynamicViewport.ts": "Tracks visual viewport changes and updates a CSS variable for stable mobile viewport height.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading, login, logout, and identity persistence handling.",
  "frontend/src/hooks/useIsTouchCapable.ts": "Detects touch-capable devices using multiple signals and updates on relevant events.",
  "frontend/src/hooks/useLandscapeOrientation.ts": "Tracks mobile orientation state and provides helpers to lock or unlock landscape mode.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating queries are defined elsewhere.",
  "frontend/src/index.css": "Defines Tailwind layers with OKLCH theme variables, responsive sizing tokens, and custom glass-card utility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context, importing global styles.",
  "frontend/src/screens/GameScreen.tsx": "Implements the main gameplay screen, wiring controls, orientation handling, autosave, and rendering the canvas, HUD, and touch controls.",
  "frontend/src/screens/MenuScreen.tsx": "Renders the animated menu with logo, title, high score card, and start/continue buttons using themed styling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, and persist URL parameters including boolean parsing and session fallback.",
  "frontend/tailwind.config.js": "Extends Tailwind with OKLCH-based colors, neon effects, animations, and custom utilities matching the app’s theme.",
  "project_state.json": "Describes the project’s current state, including touch-control feature requirements and metadata."
}