{
  "backend/main.mo": "Motoko backend storing user profiles, stats, and in‑progress runs with access‑controlled query and update methods for users and admins.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all major frontend files, their roles, and key implementation details.",
  "frontend/docs/IMPLEMENTATION_GUIDE.md": "High‑level guide describing the Space Shooter project structure and implementation overview.",
  "frontend/index.css": "Tailwind CSS base layer defining OKLCH color variables, theming for light/dark modes, and global style rules.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx into the root element.",
  "frontend/src/App.tsx": "Main React component managing menu/game state, loading stats, handling resume data, and coordinating game lifecycle.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that logs errors and displays a recovery UI with a reload button.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button with loading states, error handling, and query cache reset.",
  "frontend/src/components/RotateDeviceOverlay.tsx": "Non‑blocking rotate‑device hint overlay shown conditionally with styled messaging.",
  "frontend/src/game/controls/Joystick.tsx": "Implements a touch joystick that tracks pointer movement, applies a distance limit, and emits normalized x/y input.",
  "frontend/src/game/controls/ShootButton.tsx": "Implements a touch shoot button using pointer events, tracking press state and emitting shooting on/off.",
  "frontend/src/game/controls/useCombinedControls.ts": "Merges keyboard, joystick, and touch shooting into a single control output using magnitude comparison and deadzone logic.",
  "frontend/src/game/controls/useKeyboardControls.ts": "Tracks WASD/arrow/space keys and outputs movement and shooting state.",
  "frontend/src/game/persistence/inProgressRunStorage.ts": "Handles saving, loading, and clearing in-progress run data in localStorage with versioning.",
  "frontend/src/game/persistence/useInProgressRun.ts": "Provides hooks to check, load, save, and clear in-progress runs using localStorage and optional backend syncing.",
  "frontend/src/game/persistence/useSavedStats.ts": "Loads and saves player stats through the backend with react-query, falling back gracefully on errors.",
  "frontend/src/game/render/drawPlayerShip.ts": "Renders a stylized vector player ship with gradients, glow, and engine effects on a canvas.",
  "frontend/src/game/render/GameCanvas.tsx": "Renders the game state on a high-DPI-aware canvas, drawing borders, player ship, bullets, and other entities.",
  "frontend/src/game/types.ts": "Defines TypeScript types for game entities, state, controls, and gameplay enums.",
  "frontend/src/game/ui/Hud.tsx": "React HUD component displaying score, timer, level, phase info, and pause dialog.",
  "frontend/src/game/ui/TouchControlsDebugOverlay.tsx": "Displays detailed debug info about touch control visibility, metrics, and device detection.",
  "frontend/src/game/ui/TouchControlsHints.tsx": "Shows temporary on-screen hints guiding players on touch controls layout.",
  "frontend/src/game/ui/useTouchControlsDomSanityCheck.ts": "Hook that measures touch control DOM elements and logs warnings when invisible or off-screen.",
  "frontend/src/game/useGameEngine.ts": "Main game engine hook managing state, spawning, timers, player actions, collisions, and level logic.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on user identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useDynamicViewport.ts": "Tracks visualViewport changes and updates a CSS variable for stable mobile viewport height.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, logout, and stored identities.",
  "frontend/src/hooks/useIsTouchCapable.ts": "Detects device touch capability using several signals and updates state on changes.",
  "frontend/src/hooks/useLandscapeOrientation.ts": "Tracks mobile orientation and exposes helpers to lock or unlock landscape mode.",
  "frontend/src/hooks/useQueries.ts": "Empty module reserved for future game-specific query hooks.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme variables, dynamic viewport handling, and UI styles.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with query and Internet Identity providers.",
  "frontend/src/screens/GameScreen.tsx": "Renders the full game view, wiring controls, orientation handling, viewport updates, and game engine state.",
  "frontend/src/screens/MenuScreen.tsx": "Renders the animated main menu with high score display and navigation actions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash-based query values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color variables, animations, shadows, and plugins for the frontend UI.",
  "project_state.json": "Defines the project's current rebuild requirements, issues, and feature requests for restoring the Space Shooter game and always-visible controls."
}