{
  "kind": "build_request",
  "title": "Add spark hit VFX, varied obstacle colors, and fire-shaped equal-size bullets",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-37",
      "text": "Add a visible spark VFX at the impact point whenever a bullet hits an obstacle, in addition to the existing explosion/blast effect.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "bullets hit to obstacles then it should get spark."
        ]
      },
      "acceptanceCriteria": [
        "When a bullet collides with an obstacle, a short-lived spark effect is rendered at (or very near) the collision location immediately on hit.",
        "The spark effect is visually distinct from the existing explosion ring/glow (e.g., multiple small bright streaks/particles that quickly fade).",
        "Sparks automatically expire and are removed from the game state after a brief duration (no unbounded growth of VFX entities)."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Render obstacles in different colors (not only based on size), so multiple obstacles on screen can have visibly different neon colors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "and obstacles should be in different color."
        ]
      },
      "acceptanceCriteria": [
        "At runtime, multiple obstacles on-screen can appear in different colors simultaneously.",
        "Obstacle colors remain consistent for each obstacle for its lifetime (do not flicker every frame).",
        "Obstacle size behavior and scoring rules remain unchanged."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Update bullet visuals so bullets appear as a consistent-size, fire/flame-shaped projectile (instead of varying sizes), while keeping bullet gameplay behavior functional.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "and bullets size should be equal like fire in shape."
        ]
      },
      "acceptanceCriteria": [
        "All bullets render at the same apparent size (no small/medium/large visible size differences).",
        "Bullets render with a fire/flame-like shape (e.g., teardrop/flame silhouette with glow), oriented along the bullet travel direction.",
        "Bullet collision behavior continues to work correctly against obstacles, and bullets still originate from the player ship’s nose and travel in the ship’s facing direction."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep backend as a single Motoko actor; no backend changes are required for these visual updates."
  ],
  "nonGoals": [
    "Do not change scoring values, enemy size distribution, or level progression rules.",
    "Do not add new authentication or persistence features.",
    "Do not introduce new generated image assets for these effects; implement VFX and shapes via code rendering in the canvas."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}