{
  "kind": "build_request",
  "title": "Match on-screen joystick and shoot button layout/styling to reference image",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the touch controls overlay so that, during gameplay when touch controls are shown, the SHOOT button renders on the bottom-left and the joystick renders on the bottom-right to match the uploaded reference image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "like this joystick and shoot button i need ."
        ]
      },
      "acceptanceCriteria": [
        "When touch controls are visible, the left control is the shoot button and the right control is the joystick.",
        "No changes to touch input behavior: joystick still drives movement and shoot button still toggles shooting state.",
        "Controls remain anchored to the bottom corners and respect safe-area insets."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Adjust the shoot button visuals to match the reference image more closely: show the label text as \"SHOOT\" (not \"FIRE\") and ensure the overall button reads as a bright neon-magenta/pink circular control with clear icon+label contrast.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "like this joystick and shoot button i need ."
        ]
      },
      "acceptanceCriteria": [
        "The shoot button label reads exactly \"SHOOT\" in all caps.",
        "Shoot button remains a circular control with strong neon-magenta/pink emphasis and is easily readable over the gameplay background.",
        "Shoot press/release behavior continues to work for both touch and mouse input."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Adjust the joystick visuals to match the reference image more closely: ensure the joystick reads as a bright neon-cyan/teal circular base with a distinct inner knob, preserving existing drag/clamp behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "like this joystick and shoot button i need ."
        ]
      },
      "acceptanceCriteria": [
        "Joystick remains a circular control with a clearly visible knob and strong neon-cyan/teal emphasis.",
        "Joystick movement continues to clamp to the intended radius and returns to center on release, visibility change, resize, and orientation change.",
        "Joystick remains usable and visible above the game canvas (no z-index/pointer-events regressions)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain single-actor; no additional backend services."
  ],
  "nonGoals": [
    "Adding new gameplay mechanics or changing how movement/shooting works beyond presentation/layout changes.",
    "Implementing third-party auth or external services.",
    "Creating new backend persistence for control settings (size/location customization UI is out of scope unless explicitly requested)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}