{
  "kind": "build_request",
  "title": "Fix invisible on-screen joystick and shoot button in production",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the on-screen touch controls overlay (joystick bottom-left and SHOOT button bottom-right) is visually rendered on top of the gameplay canvas when `showTouchControls` is true, including correct positioning, sizing, safe-area padding, and z-index so the controls are not hidden behind the canvas/HUD.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "not visible joystick and shoot button"
        ]
      },
      "acceptanceCriteria": [
        "On a touch-capable mobile device in landscape during active gameplay (not paused, not game over), the joystick and SHOOT button are visible without requiring any debug/force URL parameters.",
        "Controls render above the game canvas and remain visible when interacting with the game (no accidental occlusion by other layers).",
        "Controls respect safe-area insets (e.g., iPhone notch/home indicator) and remain tappable near screen edges."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix any CSS/class issues that could cause the joystick or shoot button to be present in the DOM but invisible (e.g., opacity/visibility, zero size, incorrect positioning off-screen, incorrect stacking context, or pointer-events preventing interaction) and add a minimal regression check to prevent reintroducing invisible controls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "not visible joystick and shoot button"
        ]
      },
      "acceptanceCriteria": [
        "When `showTouchControls` is true, the joystick base and shoot button each have non-zero rendered size and are within the viewport bounds.",
        "The joystick and shoot button are visibly distinguishable against the background (not fully transparent or clipped).",
        "A simple manual test path exists to validate visibility (e.g., using `?debugControls=1` to confirm `showTouchControls: YES` and seeing the controls on-screen)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Do not modify immutable hook entrypoints (frontend/src/hooks/useInternetIdentity.ts / .tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend remains single-actor; no backend changes are required for this visibility fix."
  ],
  "nonGoals": [
    "Changing joystick/shoot gameplay behavior (movement mapping, firing logic, multitouch handling) unless required to resolve visibility.",
    "Adding new authentication methods or external services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}