{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Space Shooter VFX and projectile visual updates",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Add short-lived spark VFX at bullet impact points on obstacles, alongside existing explosion effect.",
      "acceptanceCriteria": [
        "When a bullet collides with an obstacle, a short-lived spark effect is rendered at (or very near) the collision location immediately on hit.",
        "The spark effect is visually distinct from the existing explosion ring/glow (e.g., multiple small bright streaks/particles that quickly fade).",
        "Sparks automatically expire and are removed from the game state after a brief duration (no unbounded growth of VFX entities)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/types.ts",
          "operation": "modify",
          "description": "Extend game types to represent spark VFX entities (e.g., Spark/SparkParticle) and add a sparks collection to GameState so spark effects can be tracked and expired."
        },
        {
          "path": "frontend/src/game/useGameEngine.ts",
          "operation": "modify",
          "description": "On bullet-obstacle collision, add spark VFX instances positioned at/near the collision point; implement lifetime-based cleanup so spark entities are removed after a brief duration without accumulating."
        },
        {
          "path": "frontend/src/game/render/GameCanvas.tsx",
          "operation": "modify",
          "description": "Render spark VFX from game state in the canvas as distinct bright streak/particle bursts with fast fade-out, separate from the existing explosion ring/glow rendering."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Give each obstacle a stable per-instance neon color so multiple obstacles can appear in different colors simultaneously.",
      "acceptanceCriteria": [
        "At runtime, multiple obstacles on-screen can appear in different colors simultaneously.",
        "Obstacle colors remain consistent for each obstacle for its lifetime (do not flicker every frame).",
        "Obstacle size behavior and scoring rules remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/types.ts",
          "operation": "modify",
          "description": "Add an optional/required per-enemy (obstacle) color field to the Enemy type to allow stable, per-instance color assignment independent of size."
        },
        {
          "path": "frontend/src/game/useGameEngine.ts",
          "operation": "modify",
          "description": "Assign each spawned obstacle a neon color once at creation time (from a palette or controlled random selection) and keep it unchanged for the obstacle’s lifetime; do not alter size distribution or scoring."
        },
        {
          "path": "frontend/src/game/render/GameCanvas.tsx",
          "operation": "modify",
          "description": "Use the per-obstacle color field when rendering obstacles, while preserving existing size-based geometry/behavior and leaving scoring logic unchanged."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Render bullets as equal-size, flame-shaped projectiles oriented along travel direction while preserving existing bullet gameplay behavior.",
      "acceptanceCriteria": [
        "All bullets render at the same apparent size (no small/medium/large visible size differences).",
        "Bullets render with a fire/flame-like shape (e.g., teardrop/flame silhouette with glow), oriented along the bullet travel direction.",
        "Bullet collision behavior continues to work correctly against obstacles, and bullets still originate from the player ship’s nose and travel in the ship’s facing direction."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/types.ts",
          "operation": "modify",
          "description": "Update bullet typing to support a flame/fire visual mode (e.g., add 'flame' bullet shape or simplify bullet shape/size fields) while keeping radius available for collision."
        },
        {
          "path": "frontend/src/game/useGameEngine.ts",
          "operation": "modify",
          "description": "Change bullet spawning so all bullets use a single consistent radius/visual size and a flame visual mode; preserve existing spawn-from-nose positioning and velocity aligned to ship rotation, and keep collision radius consistent with the new fixed size."
        },
        {
          "path": "frontend/src/game/render/GameCanvas.tsx",
          "operation": "modify",
          "description": "Replace current variable-size/shape bullet rendering with a consistent-size fire/flame silhouette (with glow) rotated to match bullet travel direction (vx/vy), while continuing to render all active bullets and not affecting gameplay logic."
        }
      ]
    }
  ]
}