{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make touch joystick & shoot button reliably visible above gameplay in production",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render the touch-controls overlay above the canvas/HUD with correct safe-area padding, positioning, sizing, and stacking so joystick and SHOOT are visible during gameplay when showTouchControls is true.",
      "acceptanceCriteria": [
        "On a touch-capable mobile device in landscape during active gameplay (not paused, not game over), the joystick and SHOOT button are visible without requiring any debug/force URL parameters.",
        "Controls render above the game canvas and remain visible when interacting with the game (no accidental occlusion by other layers).",
        "Controls respect safe-area insets (e.g., iPhone notch/home indicator) and remain tappable near screen edges."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Harden touch-controls overlay layering and layout: raise the stacking order above the canvas/HUD, ensure a predictable stacking context (e.g., isolate the gameplay root), and adjust safe-area-aware offsets so bottom-left joystick and bottom-right SHOOT remain on-screen and tappable across mobile landscape and small-height layouts."
        },
        {
          "path": "frontend/src/screens/GameScreen.tsx",
          "operation": "modify",
          "description": "Adjust touch-controls overlay DOM placement/wrappers so the overlay is guaranteed to render above the canvas and HUD (stacking context safe), and add stable wrapper elements for left/right controls to support safe-area-aware positioning and later visibility checks."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Eliminate CSS/stacking/positioning issues that can make controls present but invisible, and add a minimal regression check + manual debug path to detect invisible/off-screen controls early.",
      "acceptanceCriteria": [
        "When `showTouchControls` is true, the joystick base and shoot button each have non-zero rendered size and are within the viewport bounds.",
        "The joystick and shoot button are visibly distinguishable against the background (not fully transparent or clipped).",
        "A simple manual test path exists to validate visibility (e.g., using `?debugControls=1` to confirm `showTouchControls: YES` and seeing the controls on-screen)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Audit and fix any styles that can hide controls while still rendering in the DOM (e.g., unintended opacity/visibility, clipping due to overflow, off-screen absolute positioning, insufficient z-index, or stacking-context pitfalls). Ensure controls keep a non-zero size and maintain visible contrast against the game background."
        },
        {
          "path": "frontend/src/game/ui/useTouchControlsDomSanityCheck.ts",
          "operation": "create",
          "description": "Add a small, development-focused DOM sanity check utility/hook that, when showTouchControls is true (and/or when ?debugControls=1 is enabled), measures the joystick/shoot wrappers via getBoundingClientRect and logs a clear warning if size is zero or if elements are outside the viewport bounds."
        },
        {
          "path": "frontend/src/screens/GameScreen.tsx",
          "operation": "modify",
          "description": "Wire the new touch-controls DOM sanity check into gameplay rendering: attach refs/data attributes to joystick/shoot wrappers and invoke the check whenever showTouchControls becomes true. Preserve the existing manual debug path via ?debugControls=1 and keep gameplay behavior unchanged."
        },
        {
          "path": "frontend/src/game/ui/TouchControlsDebugOverlay.tsx",
          "operation": "modify",
          "description": "Enhance the debug overlay (shown via ?debugControls=1) to include a concise visibility section that can display measured joystick/shoot sizes/viewport-in-bounds status (fed from GameScreen), helping validate that controls are not invisible due to CSS/layout regressions."
        }
      ]
    }
  ]
}