{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Touch controls overlay layout + neon styling updates (shoot left, joystick right)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Swap touch controls overlay positions so SHOOT is bottom-left and joystick is bottom-right, preserving input behavior and safe-area anchoring.",
      "acceptanceCriteria": [
        "When touch controls are visible, the left control is the shoot button and the right control is the joystick.",
        "No changes to touch input behavior: joystick still drives movement and shoot button still toggles shooting state.",
        "Controls remain anchored to the bottom corners and respect safe-area insets."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/GameScreen.tsx",
          "operation": "modify",
          "description": "Swap the rendered placement of <ShootButton> and <Joystick> within the touch controls overlay so SHOOT appears in the bottom-left container and the joystick appears in the bottom-right container, without changing callbacks/wiring (joystick -> movement, shoot -> shooting state)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust .touch-controls-overlay / .touch-control-left / .touch-control-right styling as needed to ensure both controls remain anchored to the bottom corners and continue to respect env(safe-area-inset-*) padding after the left/right swap (no pointer-events/z-index regressions)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the shoot button label and styling to a brighter neon-magenta/pink circular control with high-contrast icon+label.",
      "acceptanceCriteria": [
        "The shoot button label reads exactly \"SHOOT\" in all caps.",
        "Shoot button remains a circular control with strong neon-magenta/pink emphasis and is easily readable over the gameplay background.",
        "Shoot press/release behavior continues to work for both touch and mouse input."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/controls/ShootButton.tsx",
          "operation": "modify",
          "description": "Change the displayed label text from \"FIRE\" to \"SHOOT\" and tune icon/label colors (and any related class usage) for clearer contrast while preserving the existing touch/mouse press+release logic and state toggling."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Refine .shoot-button and .shoot-icon-glow styles to more closely match the reference: stronger neon-magenta/pink emphasis for the circular button, and high-contrast icon+label styling for readability over the game canvas."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update joystick visuals to a brighter neon-cyan/teal base with a distinct inner knob while preserving current drag/clamp and reset behavior.",
      "acceptanceCriteria": [
        "Joystick remains a circular control with a clearly visible knob and strong neon-cyan/teal emphasis.",
        "Joystick movement continues to clamp to the intended radius and returns to center on release, visibility change, resize, and orientation change.",
        "Joystick remains usable and visible above the game canvas (no z-index/pointer-events regressions)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/controls/Joystick.tsx",
          "operation": "modify",
          "description": "Adjust joystick markup/classes only as needed to support the updated visual treatment (e.g., clearer knob layering/highlights) while keeping the existing drag/clamp calculations and reset handling intact."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Refine .joystick-base and .joystick-knob styling to better match the reference: brighter neon-cyan/teal circular base and a more distinct inner knob, ensuring the control remains visually above the canvas and retains correct pointer/touch interaction."
        }
      ]
    }
  ]
}